{
  "file_path": "SPECS/SIB/INTENT/TASK_ARCHIVE/160_Summary_of_Work_2025-10-23/next_tasks.md",
  "n_spec": 5,
  "n_func": 4,
  "intent_atoms": [
    {
      "type": "invariant",
      "description": "Child boxes cannot exceed parent ranges and overlapping payloads must be flagged during structural validation.",
      "source_line": null
    },
    {
      "type": "user_story",
      "description": "Run manual VoiceOver verification on macOS and iPadOS hardware to confirm the new focus command menu announces controls and restores focus targets as expected.",
      "source_line": null
    },
    {
      "type": "acceptance_criteria",
      "description": "VoiceOver regression pass for accessibility shortcuts must be achieved before completion.",
      "source_line": null
    },
    {
      "type": "invariant",
      "description": "Real‑world assets (Dolby Vision, AV1 etc.) must be licensed before synthetic payloads can be replaced and regression baselines refreshed.",
      "source_line": null
    },
    {
      "type": "architectural_decision",
      "description": "Snapshots and CLI fixtures are regenerated via ISOINSPECTOR_REGENERATE_SNAPSHOTS=1 swift test --filter JSONExportSnapshotTests when schema updates are intentional.",
      "source_line": null
    }
  ],
  "functional_units": [
    {
      "name": "Parent Containment Validation",
      "description": "Ensures child boxes cannot exceed parent ranges and flags overlapping payloads for CLI/UI surfaces.",
      "source_line": null
    },
    {
      "name": "VoiceOver Accessibility Verification",
      "description": "Manual VoiceOver verification on macOS and iPadOS to confirm focus command menu announcements and focus target restoration.",
      "source_line": null
    },
    {
      "name": "Real-World Asset Licensing Management",
      "description": "Securing licensing for Dolby Vision, AV1, VP9, Dolby AC-4, and MPEG-H fixtures to replace synthetic payloads and refresh regression baselines.",
      "source_line": null
    },
    {
      "name": "Snapshot and CLI Fixture Refresh",
      "description": "Automated regeneration of snapshots and CLI fixtures when schema updates occur via ISOINSPECTOR_REGENERATE_SNAPSHOTS environment variable.",
      "source_line": null
    }
  ],
  "metadata": {
    "file_size_bytes": 1399,
    "line_count": 6
  }
}