{
  "file_path": "SPECS/SIB/INTENT/TASK_ARCHIVE/190_T3_4_Placeholder_Nodes_for_Missing_Children/T3_5_Contextual_Status_Labels.md",
  "n_spec": 7,
  "n_func": 3,
  "intent_atoms": [
    {
      "type": "user_story",
      "description": "Deliver contextual status chips in the outline and detail inspector so operators immediately understand whether a node is invalid, empty, corrupted, partial, or trimmed when tolerant parsing surfaces issues.",
      "source_line": null
    },
    {
      "type": "acceptance_criteria",
      "description": "Outline rows render status labels with severity-aware colors and accessible text for nodes flagged as invalid, empty, corrupted, partial, or trimmed.",
      "source_line": null
    },
    {
      "type": "acceptance_criteria",
      "description": "Detail inspector mirrors the status label near existing corruption sections, keeping copy targets and VoiceOver announcements consistent.",
      "source_line": null
    },
    {
      "type": "acceptance_criteria",
      "description": "Status presentation updates automatically as ParseIssueStore emits changes, with snapshot/UI tests planned under T5 verifying the bindings.",
      "source_line": null
    },
    {
      "type": "invariant",
      "description": "ParseTreeNode.status transitions align with issue severities defined in tolerant parsing integration notes to avoid mismatched labels.",
      "source_line": null
    },
    {
      "type": "architectural_decision",
      "description": "Reuse badge styling conventions established in T3.2 for consistent typography, spacing, and accessibility hooks.",
      "source_line": null
    },
    {
      "type": "architectural_decision",
      "description": "Coordinate with the upcoming Integrity summary tab (T3.6) so the same status language propagates into aggregated issue listings and exports.",
      "source_line": null
    }
  ],
  "functional_units": [
    {
      "name": "Outline Status Chip Rendering",
      "description": "Renders status labels in outline rows for nodes flagged as invalid, empty, corrupted, partial, or trimmed with severity-aware colors and accessible text.",
      "source_line": null
    },
    {
      "name": "Detail Inspector Status Mirror",
      "description": "Displays a status label near existing corruption sections in the detail inspector, mirroring the outline status and maintaining consistent copy targets and VoiceOver announcements.",
      "source_line": null
    },
    {
      "name": "ParseIssueStore Binding Updates",
      "description": "Automatically updates status presentation as ParseIssueStore emits changes, ensuring UI reflects current node statuses.",
      "source_line": null
    }
  ],
  "metadata": {
    "file_size_bytes": 2117,
    "line_count": 27
  }
}