{
  "file_path": "SPECS/SIB/INTENT/TASK_ARCHIVE/48_macOS_SwiftUI_Automation_Streaming_Default_Selection/48_macOS_SwiftUI_Automation_Streaming_Default_Selection.md",
  "n_spec": 11,
  "n_func": 6,
  "intent_atoms": [
    {
      "type": "user_story",
      "description": "Automate a macOS SwiftUI UI test that opens a streaming parse session and verifies the tree and detail panes update with the default selection when live events arrive.",
      "source_line": null
    },
    {
      "type": "acceptance_criteria",
      "description": "The test must open a representative media file, confirm the outline view selects and displays the first node without manual interaction during streaming events.",
      "source_line": null
    },
    {
      "type": "acceptance_criteria",
      "description": "The detail pane must reflect the selected node’s metadata, demonstrating tree/detail synchronization during the automated run.",
      "source_line": null
    },
    {
      "type": "acceptance_criteria",
      "description": "The test is integrated into the existing test suite and is conditionally compiled or skipped on platforms without SwiftUI UI automation support.",
      "source_line": null
    },
    {
      "type": "acceptance_criteria",
      "description": "Documentation in next_tasks.md, the execution workplan, and backlog PRD references are updated to show this task is in progress.",
      "source_line": null
    },
    {
      "type": "invariant",
      "description": "The ParseTreeExplorerView must auto-select the first node when snapshots update.",
      "source_line": null
    },
    {
      "type": "architectural_decision",
      "description": "Extend ParseTreeExplorerView with a dependency-injectable initializer so automation can observe existing outline and detail view models while reusing production wiring.",
      "source_line": null
    },
    {
      "type": "architectural_decision",
      "description": "Reuse existing fixture media and streaming test harnesses from ISOInspectorAppTests; extend them to drive SwiftUI UI actions via the new XCTest interfaces.",
      "source_line": null
    },
    {
      "type": "architectural_decision",
      "description": "Coordinate with accessibility identifier conventions (NestedA11yIDs) to reliably locate tree rows and detail views during automation.",
      "source_line": null
    },
    {
      "type": "architectural_decision",
      "description": "Handle asynchronous event delivery by waiting on published snapshots or notifications before asserting selection state.",
      "source_line": null
    },
    {
      "type": "architectural_decision",
      "description": "Capture platform constraints (e.g., requiring macOS 13+ or skipping on Linux) in test annotations and documentation.",
      "source_line": null
    }
  ],
  "functional_units": [
    {
      "name": "ParseTreeStreamingSelectionAutomationTests",
      "description": "macOS-only XCTest UI scenario that opens a media file, drives streaming parse events, and asserts default selection and detail pane synchronization in ParseTreeExplorerView",
      "source_line": null
    },
    {
      "name": "ParseTreeExplorerView dependency-injectable initializer",
      "description": "Allows injection of outline and detail view models for testing while reusing production wiring",
      "source_line": null
    },
    {
      "name": "XCTest SwiftUI UI hooks integration",
      "description": "Provides XCTest-based UI actions to drive SwiftUI components such as tree rows and detail views via accessibility identifiers",
      "source_line": null
    },
    {
      "name": "Streaming ParsePipeline stub harness",
      "description": "Simulates streaming parse events for automated tests, feeding snapshots into the view models",
      "source_line": null
    },
    {
      "name": "Accessibility identifier coordination (NestedA11yIDs)",
      "description": "Convention for locating tree rows and detail views during automation",
      "source_line": null
    },
    {
      "name": "Conditional compilation / skip logic for platform constraints",
      "description": "Ensures tests run only on supported macOS versions or are skipped on unsupported platforms",
      "source_line": null
    }
  ],
  "metadata": {
    "file_size_bytes": 3182,
    "line_count": 83
  }
}